dudasdavid/RobotArm2k17/STM32F4/RobotArm/Src/main.c
static volatile uint32_t ADC_Buf[3];
static volatile uint32_t val[3];
static volatile float pressLength = 0;

static volatile int PenControlActive = 0;

static uint32_t TSx = 0, TSy = 0;

static volatile float pressThreshold = 0.5;
static volatile float pressTarget = 1.8;

static volatile uint32_t taskCounterDefaultTask     = 0;
static volatile uint32_t taskCounterCommTask        = 0;
static volatile uint32_t taskCounterSensorTask      = 0;
static volatile uint32_t taskCounterControlTask     = 0;
static volatile uint32_t taskCounterServoRampTask   = 0;
static volatile uint32_t taskCounterTsTask          = 0;
static volatile uint32_t taskCounterOldGraphicsTask = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);
static void MX_UART5_Init(void);
static void MX_SPI5_Init(void);
static void MX_I2C3_Init(void);
static void MX_RNG_Init(void);
static void MX_ADC1_Init(void);
static void MX_CRC_Init(void);
extern void GRAPHICS_HW_Init(void);
extern void GRAPHICS_Init(void);
extern void GRAPHICS_MainTask(void);
void StartDefaultTask(void const * argument);
void StartCommTask(void const * argument);
void StartSensorTask(void const * argument);
void StartControlTask(void const * argument);
void StartServoRampTask(void const * argument);
void StartTsTask(void const * argument);
void StartOldGraphicsTask(void const * argument);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                
                                
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
extern uint8_t CDC_Transmit_HS(uint8_t* Buf, uint16_t Len);
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc){
  
  
  if(hadc->Instance==ADC1){
    val[0] = ADC_Buf[0];
    val[1] = ADC_Buf[1];
    val[2] = ADC_Buf[2];
  }
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM4_Init();
  MX_UART5_Init();
  MX_SPI5_Init();
  MX_I2C3_Init();
  MX_RNG_Init();
  MX_ADC1_Init();
  MX_CRC_Init();
  /* USER CODE BEGIN 2 */
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);    //servoPWM1
  HAL_TIMEx_PWMN_Start(&htim2, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);    //servoPWM2
  HAL_TIMEx_PWMN_Start(&htim2, TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);    //servoPWM3
  HAL_TIMEx_PWMN_Start(&htim3, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);    //servoPWM4
  HAL_TIMEx_PWMN_Start(&htim3, TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_2);    //servoPWM5
  HAL_TIMEx_PWMN_Start(&htim4, TIM_CHANNEL_2);
  
  //TIM2->CCR1 = (int)(7.5*45000/100);//7.5 = 1.5ms
  //TIM2->CCR2 = (int)(7.5*45000/100);//10 = 2ms
  //TIM3->CCR1 = (int)(6.3*45000/100);//5 = 1ms
  //TIM3->CCR3 = (int)(7.5*45000/100);
  //TIM4->CCR2 = (int)(7.5*45000/100);

  //min 2.5 max 12.5                   -->      
  //2: 2.12 a max 1.2ms a min         -->      10.5...6.5
  //3: 1.65 ms max, 1.3ms a min  --> %-ban 8...6.3
  
  
  
  BSP_LED_On(LED3);
  BSP_LED_On(LED4);
  
  
  /* Configure USER Button */
  BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_EXTI);
  
  /*##-1- LCD Initialization #################################################*/ 
  /* Initialize the LCD */
  /*
  BSP_LCD_Init();
  BSP_LCD_LayerDefaultInit(0, LCD_FRAME_BUFFER_LAYER0);
  */
  
  //BSP_LCD_SetFont(&Font24);
  //Touchscreen_Calibration();
  BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
  
  
  
  /* USER CODE END 2 */

/* Initialise the graphical hardware */
  GRAPHICS_HW_Init();

  /* Initialise the graphical stack engine */
  GRAPHICS_Init();
      
  

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityLow, 0, 256);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* definition and creation of commTask */
  osThreadDef(commTask, StartCommTask, osPriorityHigh, 0, 128);
  commTaskHandle = osThreadCreate(osThread(commTask), NULL);

  /* definition and creation of sensorTask */
  osThreadDef(sensorTask, StartSensorTask, osPriorityBelowNormal, 0, 128);
  sensorTaskHandle = osThreadCreate(osThread(sensorTask), NULL);

  /* definition and creation of controlTask */
  osThreadDef(controlTask, StartControlTask, osPriorityAboveNormal, 0, 128);
  controlTaskHandle = osThreadCreate(osThread(controlTask), NULL);

  /* definition and creation of servoRampTask */
  osThreadDef(servoRampTask, StartServoRampTask, osPriorityNormal, 0, 128);
  servoRampTaskHandle = osThreadCreate(osThread(servoRampTask), NULL);

  /* definition and creation of tsTask */
  osThreadDef(tsTask, StartTsTask, osPriorityNormal, 0, 128);
  tsTaskHandle = osThreadCreate(osThread(tsTask), NULL);

  /* definition and creation of oldGraphicsTask */
  osThreadDef(oldGraphicsTask, StartOldGraphicsTask, osPriorityLow, 0, 256);
  oldGraphicsTaskHandle = osThreadCreate(osThread(oldGraphicsTask), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */
 

  /* Start scheduler */
  osKernelStart();
  
  /* We should never get here as control is now taken by the scheduler */

