dudasdavid/RobotArm2k17/STM32F4/RobotArm/Src/main.c
}

/* USER CODE BEGIN 4 */
void saturateFloat(volatile float* i, float min, float max) {
  float val = *i;
  if (val < min) val = min;
  else if (val > max) val = max;
  *i = val;
}

float absfloat(float num){
  if (num < 0) return (num*-1);
  else return num;
}

float deg2rad(float deg){
  float rad = 0;
  rad = (deg * F32_PI) / 180.0;
  return rad;
}

float rad2deg(float rad){
  float deg = 0;
  deg = (rad * 180) / F32_PI;
  return deg;
}

float deg2dc(float angleDeg) {
  float dc = 0;
  dc = (180-angleDeg)/dutyCycle2DegFactor;
  return dc;
}

float dc2deg(float dc) {
  float angleDeg = 0;
  angleDeg = 180 - (dc * dutyCycle2DegFactor);
  return angleDeg;
}

float receivedTurn2dc(uint16_t turnNumber){
  return (turnNumber/20.0 + 2.5);
}

float xRotate2dc(float angleDeg) {
    return (angleDeg/8.0 + 7.5 + servo1calib);
}

float gripRotate2dc(float angleDeg) {
    return (-angleDeg/14.0 + 7.5 + servo4calib);
}

float dc2turnDeg(float dc){
  return ((dc -7.5)*8);
}

float receivedGrip2dc(uint16_t gripValue){
  return (gripValue/16.0 + 5.0);
}

XYCoordinates calculateForwardKinematics(float joint1Angle, float joint2Angle){
  
  coordinates.X = verLinkLength * cosf(deg2rad(joint1Angle)) + horLinkLength * cosf(deg2rad(joint2Angle));
  coordinates.Y = verLinkLength * sinf(deg2rad(joint1Angle)) - horLinkLength * sinf(deg2rad(joint2Angle));
  
  return coordinates;
}

XYZCoordinates calculateForwardKinematicsXYZ(float jointRotAngle, float joint1Angle, float joint2Angle){
  
  coordinatesXYZ.Y = verLinkLength * cosf(deg2rad(joint1Angle)) + horLinkLength * cosf(deg2rad(joint2Angle));
  coordinatesXYZ.Z = verLinkLength * sinf(deg2rad(joint1Angle)) - horLinkLength * sinf(deg2rad(joint2Angle));
  coordinatesXYZ.X = tanf(deg2rad(jointRotAngle))*coordinatesXYZ.Y;
  
  return coordinatesXYZ;
}

JointAngles calculateInverseKinematics(float xPos, float yPos){
  
  static volatile float x_temp;
  static volatile float y_temp;
  static float c;
  static float gamma;
  static float alpha;
  static float beta;
  static float epsilon;
  static float delta;
  static float omega;
  
  x_temp = xPos;
  y_temp = yPos;
  
  c = sqrtf(xPos*xPos + yPos*yPos); //c^2=a^2+b^2
  gamma = asinf(yPos/c);
  alpha = acosf((verLinkLength*verLinkLength + c*c - horLinkLength*horLinkLength)/(2*verLinkLength*c));
  
  calculatedAngles.joint1Angle = rad2deg(gamma + alpha);
  
  beta = acosf((verLinkLength*verLinkLength + horLinkLength*horLinkLength - c*c)/(2*verLinkLength*horLinkLength));
  epsilon = 90 - rad2deg(gamma + alpha);
  delta = 90 - epsilon;
  omega = 180 - delta - rad2deg(beta);
  
  calculatedAngles.joint2angle = omega;
  
  return calculatedAngles;
}

JointAngles3Axis calculateInverseKinematics3Axis(float xPos, float yPos, float zPos){
  
  static volatile float x_temp;
  static volatile float y_temp;
  static float yPosRecalculated;
  static float c;
  static float gamma;
  static float alpha;
  static float beta;
  static float epsilon;
  static float delta;
  static float omega;
  
  x_temp = xPos;
  y_temp = yPos;
  
  calculatedAngles3Axis.jointXAngle = rad2deg(atanf(xPos/yPos));
  
  yPosRecalculated = sqrtf(yPos*yPos + xPos*xPos);
  
  c = sqrtf(yPosRecalculated*yPosRecalculated + zPos*zPos); //c^2=a^2+b^2
  gamma = asinf(zPos/c);
  alpha = acosf((verLinkLength*verLinkLength + c*c - horLinkLength*horLinkLength)/(2*verLinkLength*c));
  
  calculatedAngles3Axis.jointZAngle = rad2deg(gamma + alpha);
  
  beta = acosf((verLinkLength*verLinkLength + horLinkLength*horLinkLength - c*c)/(2*verLinkLength*horLinkLength));
  epsilon = 90 - rad2deg(gamma + alpha);
  delta = 90 - epsilon;
  omega = 180 - delta - rad2deg(beta);
  
  calculatedAngles3Axis.jointYAngle = omega;
  
  return calculatedAngles3Axis;
}

float convertADCtomm(uint32_t in){
  return in/500.0;
}

/**
   * @brief Count characters in char array
	 * @param ptr: pointer to char array
   * @retval Number of characters in array
   */
uint16_t SizeofCharArray(char *ptr)
{
  /* Local variables */
  uint16_t len = 0;
  
  /* Search until end char */
  while (ptr[len] != '\0') {   
    len++;
  }	
  return len;
}
/* USER CODE END 4 */

/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{
  /* init code for USB_DEVICE */
  MX_USB_DEVICE_Init();

/* Graphic application */  
  GRAPHICS_MainTask();

  /* USER CODE BEGIN 5 */
  
  /* Infinite loop */
  for(;;)
  {
    osDelay(500);
    taskCounterDefaultTask++;
  }
  /* USER CODE END 5 */ 
}

/* StartCommTask function */
void StartCommTask(void const * argument)
{
  /* USER CODE BEGIN StartCommTask */
  uint16_t Len = 0;
  //strcpy(txBuf, "echo: ");
  
  static int16_t turnValue = 100;
  static int16_t xPosValue = 100;
  static int16_t yPosValue = 100;
  static int16_t gripperValue = 100;
  
  static int16_t xAxisValue = 0;
  static int16_t yAxisValue = 100;
  static int16_t zAxisValue = 100;
  static int16_t aAxisValue = 100;
  
  static float xPoscm = 0;
  static float yPoscm = 0;
  
  static float xAxisCm = 0;
  static float yAxisCm = 0;
  static float zAxisCm = 0;
  
  static volatile float targetStepSizeVar = 0.024; // 1 deg/s = 0.00588
  static float numberOfSteps = 0;

  static JointAngles finalJointAngles;
  static JointAngles3Axis finalJointAngles3Axis;
  
  //uint16_t servo1ComPosRef = 75;
  /* Infinite loop */
  for(;;)
  {
    BSP_LED_Toggle(LED3);
    if (receiveState == 1){

      if ( (rxBuf[0] == 'S') && (rxBuf[4] == ';') && (rxBuf[8] == ';') && (rxBuf[12] == ';') && (rxBuf[16] == '\r')) { // check the frame
      
        turnValue = (int16_t)((rxBuf[1]  - '0')*100 + (rxBuf[2]  - '0')*10 + (rxBuf[3]  - '0')*1);
        xPosValue = (int16_t)((rxBuf[5]  - '0')*100 + (rxBuf[6]  - '0')*10 + (rxBuf[7]  - '0')*1);
        yPosValue = (int16_t)((rxBuf[9]  - '0')*100 + (rxBuf[10]  - '0')*10 + (rxBuf[11]  - '0')*1);
        gripperValue = (int16_t)((rxBuf[13]  - '0')*100 + (rxBuf[14]  - '0')*10 + (rxBuf[15]  - '0')*1);
          
        xPoscm = ((float)xPosValue)/10.0;
        yPoscm = (((float)yPosValue)-50)/10.0;
        
        if (cycleRepeat == 0){
        
          finalJointAngles = calculateInverseKinematics(xPoscm/100.0,yPoscm/100.0);
          servo3NewPosRef = deg2dc(finalJointAngles.joint1Angle);
          servo2NewPosRef = deg2dc(finalJointAngles.joint2angle);
          servo1NewPosRef = receivedTurn2dc(turnValue);
          servo4NewPosRef = receivedGrip2dc(gripperValue);
          
          if ((absfloat(servo3NewPosRef-servo3CurrPos) > absfloat(servo2NewPosRef-servo2CurrPos)) && (absfloat(servo3NewPosRef-servo3CurrPos) > absfloat(servo1NewPosRef-servo1CurrPos))){
            servo3StepSize = targetStepSizeVar;
            numberOfSteps = absfloat(servo3NewPosRef-servo3CurrPos)/targetStepSizeVar;
            servo2StepSize = absfloat(servo2NewPosRef-servo2CurrPos)/numberOfSteps;
            servo1StepSize = absfloat(servo1NewPosRef-servo1CurrPos)/numberOfSteps;
          }
          else if ((absfloat(servo2NewPosRef-servo2CurrPos) > absfloat(servo3NewPosRef-servo3CurrPos)) && (absfloat(servo2NewPosRef-servo2CurrPos) > absfloat(servo1NewPosRef-servo1CurrPos))){
            servo2StepSize = targetStepSizeVar;
            numberOfSteps = absfloat(servo2NewPosRef-servo2CurrPos)/targetStepSizeVar;
            servo3StepSize = absfloat(servo3NewPosRef-servo3CurrPos)/numberOfSteps;
            servo1StepSize = absfloat(servo1NewPosRef-servo1CurrPos)/numberOfSteps;
          }
          else{
            servo1StepSize = targetStepSizeVar;
            numberOfSteps = absfloat(servo1NewPosRef-servo1CurrPos)/targetStepSizeVar;
            servo3StepSize = absfloat(servo3NewPosRef-servo3CurrPos)/numberOfSteps;
            servo2StepSize = absfloat(servo2NewPosRef-servo2CurrPos)/numberOfSteps;
          }
        }
        
        sprintf(txBuf, "OK: %s\r", rxBuf);
        Len = SizeofCharArray((char*)txBuf);
        CDC_Transmit_HS((uint8_t*)txBuf, Len);
      }
      else if ((rxBuf[0] == 'P') && (rxBuf[4] == ';') && (rxBuf[8] == ';') && (rxBuf[12] == '\r')){//&& (rxBuf[12] == ';') && (rxBuf[16] == '\r')){
        xAxisValue = (int16_t)((rxBuf[1]  - '0')*100 + (rxBuf[2]  - '0')*10 + (rxBuf[3]  - '0')*1);
        yAxisValue = (int16_t)((rxBuf[5]  - '0')*100 + (rxBuf[6]  - '0')*10 + (rxBuf[7]  - '0')*1);
        zAxisValue = (int16_t)((rxBuf[9]  - '0')*100 + (rxBuf[10]  - '0')*10 + (rxBuf[11]  - '0')*1);
        //aAxisValue = (int16_t)((rxBuf[13]  - '0')*100 + (rxBuf[14]  - '0')*10 + (rxBuf[15]  - '0')*1);
          
        xAxisCm = ((float)xAxisValue-100)/10.0;
        yAxisCm = ((float)yAxisValue)/10.0;
        zAxisCm = ((float)zAxisValue-50)/10.0;
        
        if (cycleRepeat == 0){
          finalJointAngles3Axis = calculateInverseKinematics3Axis(xAxisCm/100.0,yAxisCm/100.0,zAxisCm/100.0);
          servo3NewPosRef = deg2dc(finalJointAngles3Axis.jointZAngle);
          servo2NewPosRef = deg2dc(finalJointAngles3Axis.jointYAngle);
          servo1NewPosRef = xRotate2dc(finalJointAngles3Axis.jointXAngle);
          servo4NewPosRef = gripRotate2dc(finalJointAngles3Axis.jointXAngle);
          targetStepSizeVar = 0.024;
          
          if ((absfloat(servo3NewPosRef-servo3CurrPos) > absfloat(servo2NewPosRef-servo2CurrPos)) && (absfloat(servo3NewPosRef-servo3CurrPos) > absfloat(servo1NewPosRef-servo1CurrPos))){
            servo3StepSize = targetStepSizeVar;
            numberOfSteps = absfloat(servo3NewPosRef-servo3CurrPos)/targetStepSizeVar;
            servo2StepSize = absfloat(servo2NewPosRef-servo2CurrPos)/numberOfSteps;
            servo1StepSize = absfloat(servo1NewPosRef-servo1CurrPos)/numberOfSteps;
            servo4StepSize = absfloat(servo4NewPosRef-servo4CurrPos)/numberOfSteps;
          }
          else if ((absfloat(servo2NewPosRef-servo2CurrPos) > absfloat(servo3NewPosRef-servo3CurrPos)) && (absfloat(servo2NewPosRef-servo2CurrPos) > absfloat(servo1NewPosRef-servo1CurrPos))){
            servo2StepSize = targetStepSizeVar;
            numberOfSteps = absfloat(servo2NewPosRef-servo2CurrPos)/targetStepSizeVar;
            servo3StepSize = absfloat(servo3NewPosRef-servo3CurrPos)/numberOfSteps;
            servo1StepSize = absfloat(servo1NewPosRef-servo1CurrPos)/numberOfSteps;
            servo4StepSize = absfloat(servo4NewPosRef-servo4CurrPos)/numberOfSteps;
          }
          else{
            servo1StepSize = targetStepSizeVar;
            numberOfSteps = absfloat(servo1NewPosRef-servo1CurrPos)/targetStepSizeVar;
            servo3StepSize = absfloat(servo3NewPosRef-servo3CurrPos)/numberOfSteps;
            servo2StepSize = absfloat(servo2NewPosRef-servo2CurrPos)/numberOfSteps;
            servo4StepSize = absfloat(servo4NewPosRef-servo4CurrPos)/numberOfSteps;
          }
        }
        sprintf(txBuf, "OK: %s\r", rxBuf);
        Len = SizeofCharArray((char*)txBuf);
        CDC_Transmit_HS((uint8_t*)txBuf, Len);
      }
      else if ((rxBuf[0] == 'P') && (rxBuf[1] == 'E') && (rxBuf[2] == 'N') && (rxBuf[4] == '\r')){
        PenControlActive = (int16_t)(rxBuf[3]  - '0');
      }
      else{
        sprintf(txBuf, "ERR: %s\r", rxBuf);
        Len = SizeofCharArray((char*)txBuf);
        CDC_Transmit_HS((uint8_t*)txBuf, Len);
        
