dudasdavid/RobotArm2k17/STM32F4/RobotArm/Src/main.c
      }
      
      receiveState = 0;

    }
    osDelay(1000);
    taskCounterCommTask++;
  }
  /* USER CODE END StartCommTask */
}

/* StartSensorTask function */
void StartSensorTask(void const * argument)
{
  /* USER CODE BEGIN StartSensorTask */
  HAL_ADC_Start_DMA(&hadc1, (uint32_t*)ADC_Buf,3);
  /* Infinite loop */
  for(;;)
  {
    pressLength = convertADCtomm(val[0]);
    osDelay(10);
    taskCounterSensorTask++;
  }
  /* USER CODE END StartSensorTask */
}

/* StartControlTask function */
void StartControlTask(void const * argument)
{
  /* USER CODE BEGIN StartControlTask */
  /* Infinite loop */
  for(;;)
  {
    
    saturateFloat(&servo1NewPosRef, servo1Min, servo1Max);
    saturateFloat(&servo2NewPosRef, servo2Min, servo2Max);
    saturateFloat(&servo3NewPosRef, servo3Min, servo3Max);
    saturateFloat(&servo4NewPosRef, servo4Min, servo4Max);
    saturateFloat(&servo5NewPosRef, servo5Min, servo5Max);
    
    if (servo1NewPosRef > servo1CurrPos){
      if (servo1NewPosRef > servo1CurrPos + servo1StepSize){
        servo1NewPos = servo1CurrPos + servo1StepSize;
      }
      else{
        servo1NewPos = servo1NewPosRef;
      }
    }
    else if (servo1NewPosRef < servo1CurrPos){
      if (servo1NewPosRef < servo1CurrPos - servo1StepSize){
        servo1NewPos = servo1CurrPos - servo1StepSize;
      }
      else{
        servo1NewPos = servo1NewPosRef;
      }
    }
    
    if (servo2NewPosRef > servo2CurrPos){
      if (servo2NewPosRef > servo2CurrPos + servo2StepSize){
        servo2NewPos = servo2CurrPos + servo2StepSize;
      }
      else{
        servo2NewPos = servo2NewPosRef;
      }
    }
    else if (servo2NewPosRef < servo2CurrPos){
      if (servo2NewPosRef < servo2CurrPos - servo2StepSize){
        servo2NewPos = servo2CurrPos - servo2StepSize;
      }
      else{
        servo2NewPos = servo2NewPosRef;
      }
    }
    
    if (servo3NewPosRef > servo3CurrPos){
      if (servo3NewPosRef > servo3CurrPos + servo3StepSize){
        servo3NewPos = servo3CurrPos + servo3StepSize;
      }
      else{
        servo3NewPos = servo3NewPosRef;
      }
    }
    else if (servo3NewPosRef < servo3CurrPos){
      if (servo3NewPosRef < servo3CurrPos - servo3StepSize){
        servo3NewPos = servo3CurrPos - servo3StepSize;
      }
      else{
        servo3NewPos = servo3NewPosRef;
      }
    }
    
    if (servo4NewPosRef > servo4CurrPos){
      if (servo4NewPosRef > servo4CurrPos + servo4StepSize){
        servo4NewPos = servo4CurrPos + servo4StepSize;
      }
      else{
        servo4NewPos = servo4NewPosRef;
      }
    }
    else if (servo4NewPosRef < servo4CurrPos){
      if (servo4NewPosRef < servo4CurrPos - servo4StepSize){
        servo4NewPos = servo4CurrPos - servo4StepSize;
      }
      else{
        servo4NewPos = servo4NewPosRef;
      }
    }
    
    if (servo5NewPosRef > servo5CurrPos){
      if (servo5NewPosRef > servo5CurrPos + servo5StepSize){
        servo5NewPos = servo5CurrPos + servo5StepSize;
      }
      else{
        servo5NewPos = servo5NewPosRef;
      }
    }
    else if (servo5NewPosRef < servo5CurrPos){
      if (servo5NewPosRef < servo5CurrPos - servo5StepSize){
        servo5NewPos = servo5CurrPos - servo5StepSize;
      }
      else{
        servo5NewPos = servo5NewPosRef;
      }
    }
    
    if (PenControlActive == 1){
      if ((pressLength - pressTarget) < -pressThreshold){
        servo3NewPos = servo3CurrPos+0.02;
        saturateFloat(&servo3NewPos, servo3Min, servo3Max);
      }
      else if ((pressLength - pressTarget) > pressThreshold){
        servo3NewPos = servo3CurrPos-0.02;
        saturateFloat(&servo3NewPos, servo3Min, servo3Max);
      }
      else {
        servo3NewPos = servo3CurrPos;
      }
      if ((servo3NewPos == servo3Min) || (servo3NewPos == servo3Max)){
        PenControlActive = 0;
      }
    }
    
    
    
    TIM2->CCR1 = (int)(servo1NewPos*60000*2/100);//7.5 = 1.5ms
    TIM2->CCR2 = (int)(servo2NewPos*60000*2/100);//10 = 2ms
    TIM3->CCR1 = (int)(servo3NewPos*60000*2/100);//5 = 1ms
    TIM3->CCR3 = (int)(servo4NewPos*60000*2/100);
    TIM4->CCR2 = (int)(servo5NewPos*60000*2/100);
    
    servo1CurrPos = servo1NewPos;
    servo2CurrPos = servo2NewPos;
    servo3CurrPos = servo3NewPos;
    servo4CurrPos = servo4NewPos;
    servo5CurrPos = servo5NewPos;
    
    osDelay(10);
    taskCounterControlTask++;
  }
  /* USER CODE END StartControlTask */
}

/* StartServoRampTask function */
void StartServoRampTask(void const * argument)
{
  /* USER CODE BEGIN StartServoRampTask */
  int taskCounter = 0;
  int taskDelay = 1000;
  /* Infinite loop */
  for(;;)
  {
    if (mode % 2 == 1) {
      if (taskCounter % 2 == 0){
        servo2NewPosRef = 8;
        servo3NewPosRef = 6.8;
      }
      else{
        servo2NewPosRef = 10;
        servo3NewPosRef = 6.8;
      }
      taskCounter++;
      osDelay(500);
    }
    else if (cycleRepeat == 1){
      if (taskCounter % 12 == 0){
        servo3NewPosRef = 6.8;
        servo4NewPosRef = 6;
        servo1StepSize = 0.03;
        taskDelay = 1000;
      }
      else if (taskCounter % 12 == 1){
        servo2NewPosRef = 9;
        taskDelay = 1000;
      }
      else if (taskCounter % 12 == 2){
        servo1NewPosRef = 7.5;
        taskDelay = 2000;
      }
      else if (taskCounter % 12 == 3){
        servo1NewPosRef = 3;
        servo2NewPosRef = 7.5;
        taskDelay = 2000;
      }
      else if (taskCounter % 12 == 4){
        
        servo3NewPosRef = 9.25;
        taskDelay = 1500;
      }
      else if (taskCounter % 12 == 5){
        servo4NewPosRef = 9.2;
        taskDelay = 1500;
      }
      else if (taskCounter % 12 == 6){
        servo1NewPosRef = 7.5;
        servo2NewPosRef = 10.7;
        servo3NewPosRef = 6.8;
        servo2StepSize = 0.03;
        servo3StepSize = 0.03;
        taskDelay = 2500;
      }
      else if (taskCounter % 12 == 7){
        servo2NewPosRef = 10.7;
        servo3NewPosRef = 8;
        servo2StepSize = 0.03;
        taskDelay = 500;
      }
      else if (taskCounter % 12 == 8){
        servo2NewPosRef = 10.7;
        servo3NewPosRef = 6.8;
        taskDelay = 1000;
      }
      else if (taskCounter % 12 == 9){
        servo1NewPosRef = 3;
        servo2NewPosRef = 7.5;
        servo2StepSize = 0.03;
        taskDelay = 2000;
      }
      else if (taskCounter % 12 == 10){
        servo3NewPosRef = 9.25;
        taskDelay = 1500;
      }
      else if (taskCounter % 12 == 11){
        servo2StepSize = 0.03;
        servo4NewPosRef = 6;
        taskDelay = 1500;
        taskDelay = 30000;
        //cycleRepeat = 0;
      }
      
      taskCounter++;
      osDelay(taskDelay);
      taskCounterServoRampTask++;
    }
    else{
      osDelay(500);
      taskCounterServoRampTask++;
    }
  }
  /* USER CODE END StartServoRampTask */
}

/* StartTsTask function */
void StartTsTask(void const * argument)
{
  /* USER CODE BEGIN StartTsTask */
  TS_StateTypeDef  State;
  
