dudasdavid/RobotArm2k17/STM32F4/RobotArm/Src/main.c
  /* Infinite loop */
  for(;;)
  {
    BSP_TS_GetState(&State);

    TSx = State.X;
    TSy = State.Y; 
    
    if (State.TouchDetected){
      BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
      BSP_LCD_DrawCircle(TSx,TSy,3);
      BSP_LCD_SetTextColor(BACKGROUND_COLOR);
      //BSP_LCD_FillCircle(120, 160, 80);
    }
    else{
      //BSP_LCD_SetTextColor(LCD_COLOR_RED);
      //BSP_LCD_FillCircle(120, 160, 80);
    }
    
    osDelay(100);
    taskCounterTsTask++;
  }
  /* USER CODE END StartTsTask */
}

/* StartOldGraphicsTask function */
void StartOldGraphicsTask(void const * argument)
{
  /* USER CODE BEGIN StartOldGraphicsTask */
  int elapsedTime = 0;
  char textBuf[30];
  float verLinkAngleAfterRefresh = 0;
  float horLinkAngleAfterRefresh = 0;
  float turnAngleAfterRefresh = 0;
  
  XYZCoordinates endPoint;
  //JointAngles finalJointAngles;
  osDelay(1000);
  
  BSP_LCD_SelectLayer(0);
  
  BSP_LCD_Clear(LCD_COLOR_BLACK);
  BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
  BSP_LCD_SetTextColor(LCD_COLOR_CYAN);
  BSP_LCD_SetFont(&Font16);
  BSP_LCD_DrawRect(0,0,239,319);
  BSP_LCD_DisplayStringAt(5,8,"RobotArm Control 2.0",LEFT_MODE);
  BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
  
  /* Infinite loop */
  for(;;)
  {
    if ((BSP_PB_GetState(BUTTON_KEY) == SET) && (elapsedTime > 10)){
      //mode++;
      //cycleRepeat = 1;
      cycleRepeat ^= 1;
      BSP_LCD_DisplayChar(5,25,(char)(cycleRepeat+48));
      elapsedTime = 0;
    }
    
    if (elapsedTime < 100){
      elapsedTime+=1;
    }
    
    verLinkAngle = dc2deg(servo3CurrPos);
    horLinkAngle = dc2deg(servo2CurrPos);
    turnAngle    = dc2turnDeg(servo1CurrPos - servo1calib);
    
    //sprintf(textBuf, "V joint: %.2f deg",  verLinkAngle);
    //BSP_LCD_DisplayStringAt(5, 45, (unsigned char*) textBuf, LEFT_MODE);
    //sprintf(textBuf, "H joint: %.2f deg",  horLinkAngle);
    //BSP_LCD_DisplayStringAt(5, 60, (unsigned char*) textBuf, LEFT_MODE);
    
    
    endPoint = calculateForwardKinematicsXYZ(turnAngle,verLinkAngle,horLinkAngle);
    
    BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
    sprintf(textBuf, "X: %.1f cm    ", (endPoint.X*100));
    BSP_LCD_DisplayStringAt(5, 45, (unsigned char*) textBuf, LEFT_MODE);
    sprintf(textBuf, "Y: %.1f cm    ", (endPoint.Y*100));
    BSP_LCD_DisplayStringAt(5, 60, (unsigned char*) textBuf, LEFT_MODE);
    sprintf(textBuf, "Z: %.1f cm    ", (endPoint.Z*100));
    BSP_LCD_DisplayStringAt(5, 75, (unsigned char*) textBuf, LEFT_MODE);
    sprintf(textBuf, "A: %.1f mm    ", (pressLength));
    BSP_LCD_DisplayStringAt(5, 90, (unsigned char*) textBuf, LEFT_MODE);
    
    if (((verLinkAngleAfterRefresh != verLinkAngle) || (horLinkAngleAfterRefresh != horLinkAngle) || (turnAngleAfterRefresh != turnAngle)) && (graphicsEna)) {
      BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
      BSP_LCD_FillRect(5,135,230,180);
      BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
      
      verLinkAngleAfterRefresh = verLinkAngle;
      horLinkAngleAfterRefresh = horLinkAngle;
      turnAngleAfterRefresh    = turnAngle;
      
      verLinkPoints[0].X = 45;
      verLinkPoints[0].Y = 250;
      verLinkPoints[1].X = verLinkPoints[0].X + 10;
      verLinkPoints[1].Y = verLinkPoints[0].Y;
      
      verLinkPoints[3].X = (int16_t)(verLinkPoints[0].X + (74.25*cosf(deg2rad(verLinkAngle))));
      verLinkPoints[3].Y = (int16_t)(verLinkPoints[0].Y - (74.25*sinf(deg2rad(verLinkAngle))));
      verLinkPoints[2].X = verLinkPoints[3].X + 10;
      verLinkPoints[2].Y = verLinkPoints[3].Y;
      
      horLinkPoints[0].X = verLinkPoints[2].X;
      horLinkPoints[0].Y = verLinkPoints[2].Y;
      horLinkPoints[1].X = verLinkPoints[2].X;
      horLinkPoints[1].Y = verLinkPoints[2].Y + 10;
      
      horLinkPoints[3].X = (int16_t)(horLinkPoints[0].X + (82.5*cosf(deg2rad(horLinkAngle))));
      horLinkPoints[3].Y = (int16_t)(horLinkPoints[0].Y + (82.5*sinf(deg2rad(horLinkAngle))));
      horLinkPoints[2].X = horLinkPoints[3].X;
      horLinkPoints[2].Y = horLinkPoints[3].Y + 10; 
        
      BSP_LCD_FillRect(30, 250, 40, 40);
      BSP_LCD_FillPolygon(verLinkPoints, 4);
      BSP_LCD_FillPolygon(horLinkPoints, 4);
      BSP_LCD_FillRect(horLinkPoints[3].X, horLinkPoints[3].Y, 30, 10);
      
      BSP_LCD_FillCircle(50,250,10);
      BSP_LCD_FillCircle(verLinkPoints[3].X+5,verLinkPoints[3].Y+5,10);
      BSP_LCD_FillCircle(horLinkPoints[3].X,horLinkPoints[3].Y+5,10);
      BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
      BSP_LCD_FillCircle(50,250,5);
      BSP_LCD_FillCircle(verLinkPoints[3].X+5,verLinkPoints[3].Y+5,5);
      BSP_LCD_FillCircle(horLinkPoints[3].X,horLinkPoints[3].Y+5,5);
      BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
      
      if (turnAngle < -0.1){
        sprintf(textBuf, "   %.1f ->",  (turnAngle*-1));
      }
      else if (turnAngle > 0.1){
        sprintf(textBuf, "<- %.1f",  turnAngle);
      }
      else {
        sprintf(textBuf, "   %.1f",  turnAngle);
      }
      BSP_LCD_SetFont(&Font12);
      BSP_LCD_DisplayStringAt(15, 300, (unsigned char*) textBuf, LEFT_MODE);
      BSP_LCD_SetFont(&Font16);
    }
    
    
    
    osDelay(100);
    taskCounterOldGraphicsTask++;
  }
  /* USER CODE END StartOldGraphicsTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
